Repository: kamiljasinski191/easy_gpt_chat
Catalog: lib/l10n/app_*.arb
Languages: pl

# initializingApp
source: Initializing app. Please wait...
pl: Inicjowanie apki. Proszę czekać...

# itIsDemo
source: It's demo of ChatGPT from official API,
pl: To jest demo ChatGPT z oficjalnego API,

# andYouNeed
source: and u need official ApiKey from openAi.com.
pl: i potrzebujesz oficjalnego KluczApi z openAi.com.

# pleaseVisit
source: Please visit, to get your Key:
pl: Proszę odwiedź, by zdobyć swój Klucz:

# setKey
source: Set your ApiKey
pl: Ustaw swój KluczApi

# noInternet
source: No internet connection.
pl: Brak połączenia z internetem.

# checkInternet
source: Check your connection and try again.
pl: Sprawdź połączenie i spróbuj ponownie.

source: Reload
pl: Odśwież

# anError
source: An error has ocured.
pl: Wystąpił błąd.

# apiKeyInvalid
source: ApiKey is invalid.
pl: KluczApi jest niepoprawny.

# setNewKey
source: Set New ApiKey
pl: Ustaw nowy KluczApi

# reloadAndTryAgain
source: Reload app and try again.
pl: Odśwież i spróbuj ponownie.

# sendMessage
source: Send a message
pl: Wyślij wiadomość

source: About App
pl: O Aplikacji

source: Reset ApiKey
pl: Resetowanie KluczaApi

# aboutAppContent
source: EasyGPT Chat is a simple application that uses the official OpenAI API.Unfortunately, it is just a demo, so the chat has limitations.For example, it does not know the current date.
pl: EasyGPT Chat to prosta aplikacja, która wykorzystuje oficjalne API OpenAI.Niestety jest to tylko wersja demonstracyjna, więc czat ma ograniczenia.Na przykład nie wie, jaka jest aktualna data.

# areYouSure
source: Are you sure you want to reset your API key?
pl: Czy jesteś pewny/a że chcesz zresetować KluczApi?

source: Yes
pl: Tak

source: No!
pl: Nie!

source: Welcome Back!
pl: Witamy Ponownie!

source: LogIn as Guest
pl: Zaloguj jako Gość

# creatingAccountNotAvailable
source: Creating an account is not yet possible. Please be patient as we will introduce this functionality soon.
pl: Zakładanie konta nie jest jeszcze możliwe. Prosimy o cierpliwość wprowadzimy tą funkcjonalność wkrótce.

# watchAd
source: Wach an Ad for 5 tokens?
pl: Obejrzeć reklamę za 5 tokenów?

# adReward
source: Rewarder Ad
pl: Reklamna z nagrodą

source: LogOut!
pl: Wyloguj!

# wantToLogOut
source: Do you realy want to log out??
pl: Czy napewno chcesz się wylogować??
